app/controllers/events_controller.rb

  def index
    @events = Event.where(:user_id => current_user.id).order("created_at desc")
---
SELECT `events`.* FROM `events` WHERE `events`.`user_id` = 1 ORDER BY created_at desc